Revit 2027 API
IExternalApplication Methods
The IExternalApplication type exposes the following members.
Methods
Name | Description
OnShutdown | Implement this method to execute some tasks when Autodesk Revit shuts down.
OnStartup | Implement this method to execute some tasks when Autodesk Revit starts.
Top
See Also
Reference
IExternalApplication Interface
Autodesk.Revit.UI Namespace